; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_3 object type_2 type_1)
 (:predicates (pred_3 ?v5 - type_2 ?v3 - type_3)
 	      (pred_2 ?v2 - object ?v3 - type_3)
	      (pred_4 ?v5 - type_2 ?v1 - type_1)
	      (pred_1 ?v5 - type_2 ?v2 - object ?v1 - type_1))

   (:action op_2
       :parameters  (?v5 - type_2 ?v7 ?v6 - type_3)
       :precondition (and  (pred_3 ?v5 ?v7))
       :effect (and  (pred_3 ?v5 ?v6)
		     (not (pred_3 ?v5 ?v7))))

   (:action op_1
       :parameters (?v5 - type_2 ?v8 - object ?v4 - type_3 ?v1 - type_1)
       :precondition  (and  (pred_2 ?v8 ?v4) (pred_3 ?v5 ?v4) (pred_4 ?v5 ?v1))
       :effect (and (pred_1 ?v5 ?v8 ?v1)
		    (not (pred_2 ?v8 ?v4)) 
		    (not (pred_4 ?v5 ?v1))))

   (:action op_3
       :parameters (?v5 - type_2 ?v8 - object ?v4 - type_3 ?v1 - type_1)
       :precondition  (and  (pred_1 ?v5 ?v8 ?v1) (pred_3 ?v5 ?v4))
       :effect (and (pred_2 ?v8 ?v4)
		    (pred_4 ?v5 ?v1)
		    (not (pred_1 ?v5 ?v8 ?v1)))))

; problem
(define (problem gripper-2-3-3)
(:domain gripper-strips)
(:objects obj_04 obj_11 - type_2
obj_09 obj_02 obj_06 obj_08 - type_1
obj_07 obj_01 obj_03 - type_3
obj_05 obj_12 obj_10 - object)
(:init
(pred_3 obj_04 obj_01)
(pred_4 obj_04 obj_09)
(pred_4 obj_04 obj_02)
(pred_3 obj_11 obj_03)
(pred_4 obj_11 obj_06)
(pred_4 obj_11 obj_08)
(pred_2 obj_05 obj_01)
(pred_2 obj_12 obj_07)
(pred_2 obj_10 obj_07)
)
(:goal
(and
(pred_2 obj_05 obj_03)
(pred_2 obj_12 obj_07)
(pred_2 obj_10 obj_03)
)
)

(:constraints
  (and
    (always (not (and (pred_3 obj_04 obj_03) (pred_3 obj_11 obj_03))))
  )
)
)

; plan
1. (op_1 obj_04 obj_05 obj_01 obj_02)
   deleted: (pred_2 obj_05 obj_01) (pred_4 obj_04 obj_02)
   added: (pred_1 obj_04 obj_05 obj_02)
   goals met: 1 of 3
2. (op_2 obj_11 obj_03 obj_07)
   deleted: (pred_3 obj_11 obj_03)
   added: (pred_3 obj_11 obj_07)
   goals met: 1 of 3
3. (op_2 obj_04 obj_01 obj_07)
   deleted: (pred_3 obj_04 obj_01)
   added: (pred_3 obj_04 obj_07)
   goals met: 1 of 3
4. (op_1 obj_04 obj_10 obj_07 obj_09)
   deleted: (pred_2 obj_10 obj_07) (pred_4 obj_04 obj_09)
   added: (pred_1 obj_04 obj_10 obj_09)
   goals met: 1 of 3
5. (op_2 obj_04 obj_07 obj_03)
   deleted: (pred_3 obj_04 obj_07)
   added: (pred_3 obj_04 obj_03)
   goals met: 1 of 3
6. (op_3 obj_04 obj_10 obj_03 obj_09)
   deleted: (pred_1 obj_04 obj_10 obj_09)
   added: (pred_2 obj_10 obj_03) (pred_4 obj_04 obj_09)
   goals met: 2 of 3
7. (op_3 obj_04 obj_05 obj_03 obj_02)
   deleted: (pred_1 obj_04 obj_05 obj_02)
   added: (pred_2 obj_05 obj_03) (pred_4 obj_04 obj_02)
   goals met: 3 of 3
